#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_api_management_api.to_do_api will be destroyed
  # (because azurerm_api_management_api.to_do_api is not in configuration)
  - resource "azurerm_api_management_api" "to_do_api" {
      - api_management_name   = "dx-d-itn-playground-pg-apim-01" -> null
      - api_type              = "http" -> null
      - description           = "To Do List API" -> null
      - display_name          = "To Do API" -> null
      - id                    = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api;rev=1" -> null
      - is_current            = true -> null
      - is_online             = false -> null
      - name                  = "to-do-api" -> null
      - path                  = "api/v1" -> null
      - protocols             = [
          - "https",
        ] -> null
      - resource_group_name   = "dx-d-itn-test-rg-01" -> null
      - revision              = "1" -> null
      - soap_pass_through     = false -> null
      - subscription_required = true -> null
        # (6 unchanged attributes hidden)

      - import {
          - content_format = "openapi" -> null
          - content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  title: To Do List API
                  version: 0.0.0
                paths:
                
                  /info:
                    get:
                      operationId: info
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ApplicationInfo'
                        '500':
                          description: Internal Server error
                
                components:
                  schemas:
                    ApplicationInfo:
                      type: object
                      properties:
                        name:
                          type: string
                        version:
                          type: string
                      required:
                        - name
                        - version
            EOT -> null
        }

      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }
    }

  # azurerm_api_management_backend.to_do_api_fn will be destroyed
  # (because azurerm_api_management_backend.to_do_api_fn is not in configuration)
  - resource "azurerm_api_management_backend" "to_do_api_fn" {
      - api_management_name = "dx-d-itn-playground-pg-apim-01" -> null
      - description         = "To Do List API" -> null
      - id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/backends/to-do-api-azure-function" -> null
      - name                = "to-do-api-azure-function" -> null
      - protocol            = "http" -> null
      - resource_group_name = "dx-d-itn-test-rg-01" -> null
      - url                 = "https://dx-d-itn-playground-be-func-01.azurewebsites.net" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_network_interface_security_group_association.activegate_nsg will be destroyed
  # (because azurerm_network_interface_security_group_association.activegate_nsg is not in configuration)
  - resource "azurerm_network_interface_security_group_association" "activegate_nsg" {
      - id                        = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-playground-pg-dynatrace-rg-01/providers/Microsoft.Network/networkInterfaces/dx-d-itn-playground-pg-activegate-nic-01|/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-playground-pg-dynatrace-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-playground-pg-dynatrace-poc-nsg-01" -> null
      - network_interface_id      = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-playground-pg-dynatrace-rg-01/providers/Microsoft.Network/networkInterfaces/dx-d-itn-playground-pg-activegate-nic-01" -> null
      - network_security_group_id = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-playground-pg-dynatrace-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-playground-pg-dynatrace-poc-nsg-01" -> null
    }

  # azurerm_network_security_group.dynatrace_nsg will be destroyed
  # (because azurerm_network_security_group.dynatrace_nsg is not in configuration)
  - resource "azurerm_network_security_group" "dynatrace_nsg" {
      - id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-playground-pg-dynatrace-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-playground-pg-dynatrace-poc-nsg-01" -> null
      - location            = "italynorth" -> null
      - name                = "dx-d-itn-playground-pg-dynatrace-poc-nsg-01" -> null
      - resource_group_name = "dx-d-itn-playground-pg-dynatrace-rg-01" -> null
      - security_rule       = [
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "9999"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Allow-Dynatrace-Inbound"
              - priority                                   = 100
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "443"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Allow-HTTPS"
              - priority                                   = 130
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "Internet"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Allow-HTTP"
              - priority                                   = 120
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "Internet"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "Internet"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Outbound"
              - name                                       = "Allow-Outbound"
              - priority                                   = 200
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> null
      - tags                = {
          - "CostCenter"  = "TS700 - ENGINEERING"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Dev"
          - "Owner"       = "DevEx"
          - "Scope"       = "Dynatrace PoC"
        } -> null
    }

  # azurerm_public_ip.dynatrace_activegate will be destroyed
  # (because azurerm_public_ip.dynatrace_activegate is not in configuration)
  - resource "azurerm_public_ip" "dynatrace_activegate" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-playground-pg-dynatrace-rg-01/providers/Microsoft.Network/publicIPAddresses/dx-d-itn-playground-pg-dynatrace-poc-01" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "72.146.44.100" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "italynorth" -> null
      - name                    = "dx-d-itn-playground-pg-dynatrace-poc-01" -> null
      - resource_group_name     = "dx-d-itn-playground-pg-dynatrace-rg-01" -> null
      - sku                     = "Basic" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {
          - "CostCenter"  = "TS700 - ENGINEERING"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Dev"
          - "Owner"       = "DevEx"
          - "Scope"       = "Dynatrace PoC"
        } -> null
      - zones                   = [] -> null
        # (1 unchanged attribute hidden)
    }

  # module.dynatrace_activegate.azurerm_network_interface.nic will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-playground-pg-dynatrace-rg-01/providers/Microsoft.Network/networkInterfaces/dx-d-itn-playground-pg-activegate-nic-01"
        name                           = "dx-d-itn-playground-pg-activegate-nic-01"
        tags                           = {
            "CostCenter"  = "TS700 - ENGINEERING"
            "CreatedBy"   = "Terraform"
            "Environment" = "Dev"
            "Owner"       = "DevEx"
            "Scope"       = "Dynatrace PoC"
        }
        # (17 unchanged attributes hidden)

      ~ ip_configuration {
            name                                               = "internal"
          - public_ip_address_id                               = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-playground-pg-dynatrace-rg-01/providers/Microsoft.Network/publicIPAddresses/dx-d-itn-playground-pg-dynatrace-poc-01" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # module.function_app.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-be-func-01"
        name                                           = "dx-d-itn-playground-be-func-01"
        tags                                           = {
            "CostCenter"  = "TS700 - ENGINEERING"
            "CreatedBy"   = "Terraform"
            "Environment" = "Dev"
            "Owner"       = "DevEx"
            "Scope"       = "Dynatrace PoC"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_path                             = "/info" -> "/api/info"
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.to_do_api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "dx-d-itn-playground-pg-apim-01"
      + api_type              = (known after apply)
      + description           = "API to handle a To Do list"
      + display_name          = "To Do API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "to-do-api"
      + path                  = "todo"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "dx-d-itn-test-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  title: To Do List API
                  version: 0.0.0
                paths:
                
                  /info:
                    get:
                      operationId: info
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ApplicationInfo'
                        '500':
                          description: Internal Server error
                
                components:
                  schemas:
                    ApplicationInfo:
                      type: object
                      properties:
                        name:
                          type: string
                        version:
                          type: string
                      required:
                        - name
                        - version
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.to_do_api.azurerm_api_management_api_policy.policy will be created
  + resource "azurerm_api_management_api_policy" "policy" {
      + api_management_name = "dx-d-itn-playground-pg-apim-01"
      + api_name            = "to-do-api"
      + id                  = (known after apply)
      + resource_group_name = "dx-d-itn-test-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <base />
                <set-backend-service backend-id="to-do-api-azure-function" />
            
                 <!-- Append base-path, if defined, before invoking the backend -->
                <choose>
                  <when condition='@(System.String.IsNullOrEmpty("api"))'>
                  </when>
                  <otherwise>
                    <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
                  </otherwise>
                </choose>
            
                <cors>
                  <allowed-origins>
                      <origin>*</origin>
                  </allowed-origins>
                  <allowed-methods>
                      <method>*</method>
                  </allowed-methods>
                  <allowed-headers>
                      <header>*</header>
                  </allowed-headers>
                  <expose-headers>
                      <header>*</header>
                  </expose-headers>
                </cors>
              </inbound>
              <outbound>
                <base />
              </outbound>
              <backend>
                <base />
              </backend>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.to_do_api.azurerm_api_management_backend.backend will be created
  + resource "azurerm_api_management_backend" "backend" {
      + api_management_name = "dx-d-itn-playground-pg-apim-01"
      + description         = "API to handle a To Do list"
      + id                  = (known after apply)
      + name                = "to-do-api-azure-function"
      + protocol            = "http"
      + resource_group_name = "dx-d-itn-test-rg-01"
      + url                 = "https://dx-d-itn-playground-be-func-01.azurewebsites.net"
    }

Plan: 3 to add, 2 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
